; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v3 - type_3 ?v8 - type_1)
 	      (pred_2 ?v6 - object ?v8 - type_1)
	      (pred_3 ?v3 - type_3 ?v5 - type_2)
	      (pred_4 ?v3 - type_3 ?v6 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v3 - type_3 ?v2 ?v7 - type_1)
       :precondition (and  (pred_1 ?v3 ?v2))
       :effect (and  (pred_1 ?v3 ?v7)
		     (not (pred_1 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v1) (pred_1 ?v3 ?v1) (pred_3 ?v3 ?v5))
       :effect (and (pred_4 ?v3 ?v4 ?v5)
		    (not (pred_2 ?v4 ?v1)) 
		    (not (pred_3 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v4 ?v5) (pred_1 ?v3 ?v1))
       :effect (and (pred_2 ?v4 ?v1)
		    (pred_3 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v4 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_13 - type_1
obj_03 obj_08 obj_02 obj_05 - type_2
obj_06 obj_09 obj_01 obj_07 - type_3
obj_04 obj_12 obj_10 obj_14 - object)
(:init
(pred_1 obj_11 obj_07)
(pred_3 obj_11 obj_03)
(pred_3 obj_11 obj_08)
(pred_1 obj_13 obj_09)
(pred_3 obj_13 obj_02)
(pred_3 obj_13 obj_05)
(pred_2 obj_04 obj_09)
(pred_2 obj_12 obj_07)
(pred_2 obj_10 obj_01)
(pred_2 obj_14 obj_06)
)
(:goal
(and
(pred_2 obj_04 obj_09)
(pred_2 obj_12 obj_01)
(pred_2 obj_10 obj_07)
(pred_2 obj_14 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_11 obj_01)))
)
)

; plan
1. (op_3 obj_11 obj_12 obj_07 obj_08)
   deleted: (pred_2 obj_12 obj_07) (pred_3 obj_11 obj_08)
   added: (pred_4 obj_11 obj_12 obj_08)
   goals met: 1 of 4
2. (op_1 obj_13 obj_09 obj_06)
   deleted: (pred_1 obj_13 obj_09)
   added: (pred_1 obj_13 obj_06)
   goals met: 1 of 4
3. (op_3 obj_13 obj_14 obj_06 obj_05)
   deleted: (pred_2 obj_14 obj_06) (pred_3 obj_13 obj_05)
   added: (pred_4 obj_13 obj_14 obj_05)
   goals met: 1 of 4
4. (op_1 obj_13 obj_06 obj_09)
   deleted: (pred_1 obj_13 obj_06)
   added: (pred_1 obj_13 obj_09)
   goals met: 1 of 4
5. (op_2 obj_13 obj_14 obj_09 obj_05)
   deleted: (pred_4 obj_13 obj_14 obj_05)
   added: (pred_2 obj_14 obj_09) (pred_3 obj_13 obj_05)
   goals met: 2 of 4
6. (op_1 obj_13 obj_09 obj_01)
   deleted: (pred_1 obj_13 obj_09)
   added: (pred_1 obj_13 obj_01)
   goals met: 2 of 4
7. (op_3 obj_13 obj_10 obj_01 obj_05)
   deleted: (pred_2 obj_10 obj_01) (pred_3 obj_13 obj_05)
   added: (pred_4 obj_13 obj_10 obj_05)
   goals met: 2 of 4
8. (op_1 obj_13 obj_01 obj_07)
   deleted: (pred_1 obj_13 obj_01)
   added: (pred_1 obj_13 obj_07)
   goals met: 2 of 4
9. (op_2 obj_13 obj_10 obj_07 obj_05)
   deleted: (pred_4 obj_13 obj_10 obj_05)
   added: (pred_2 obj_10 obj_07) (pred_3 obj_13 obj_05)
   goals met: 3 of 4
10. (op_2 obj_11 obj_12 obj_07 obj_08)
   deleted: (pred_4 obj_11 obj_12 obj_08)
   added: (pred_2 obj_12 obj_07) (pred_3 obj_11 obj_08)
   goals met: 3 of 4
11. (op_3 obj_13 obj_12 obj_07 obj_05)
   deleted: (pred_2 obj_12 obj_07) (pred_3 obj_13 obj_05)
   added: (pred_4 obj_13 obj_12 obj_05)
   goals met: 3 of 4
12. (op_1 obj_13 obj_07 obj_01)
   deleted: (pred_1 obj_13 obj_07)
   added: (pred_1 obj_13 obj_01)
   goals met: 3 of 4
13. (op_2 obj_13 obj_12 obj_01 obj_05)
   deleted: (pred_4 obj_13 obj_12 obj_05)
   added: (pred_2 obj_12 obj_01) (pred_3 obj_13 obj_05)
   goals met: 4 of 4
